In [3]:
import pandas as pede

df = pede.read_csv('titanic.csv')

print()
print('Ini adalah hasil dari Load data & Exploratory analysis.\n')

df.info()
df.isnull().sum()

Ini adalah hasil dari Load data & Exploratory analysis.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 714 entries, 0 to 713
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  714 non-null    int64
 1   pclass    714 non-null    int64
 2   name      714 non-null    object
 3   sex       714 non-null    object
 4   age       714 non-null    float64
 5   fare      714 non-null    float64
 6   sibsp     714 non-null    int64
 7   parch     714 non-null    int64
dtypes: float64(2), int64(4), object(2)
memory usage: 44.8+ KB

survived    0
pclass      0
name        0
sex         0
age         0
fare        0
sibsp       0
parch       0
dtype: int64

In [4]:
import pandas as pede

df = pede.read_csv('titanic.csv')

print()
print('--- Ini adalah hasil dari Load data & Exploratory analysis dan deteksi masalah data. ---\n')

df.describe()

--- Ini adalah hasil dari Load data & Exploratory analysis dan deteksi masalah data. ---

         survived      pclass         age        fare       sibsp       parch
count  714.000000  714.000000  714.000000  714.000000  714.000000  714.000000
mean     0.406162    2.236695   29.699118   34.694514    0.512605    0.431373
std      0.491460    0.838250   14.526497   52.918930    0.929783    0.853289
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    1.000000   20.125000    8.050000    0.000000    0.000000
50%      0.000000    2.000000   28.000000   15.741700    0.000000    0.000000
75%      1.000000    3.000000   38.000000   33.375000    1.000000    1.000000
max      1.000000    3.000000   80.000000  512.329200    5.000000    6.000000

In [7]:
import pandas as pede

df = pede.read_csv('titanic.csv')

print()
print('--- Ini adalah hasil dari Imputasi data dan menampilkan tujuh urutan awal pada data. ---\n')

mean_age = df['age'].mean()
df['age'] = df['age'].fillna(mean_age)

df['age'] = df['age'].astype(int)
df.head(7)

--- Ini adalah hasil dari Imputasi data dan menampilkan tujuh urutan awal pada data. ---

,survived,pclass,name,sex,age,fare,sibsp,parch
0,0,3,"Braund, Mr. Owen Harris",male,22,7.2500,1,0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,71.2833,1,0
2,1,3,"Heikkinen, Miss. Laina",female,26,7.9250,0,0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,53.1000,1,0
4,0,3,"Allen, Mr. William Henry",male,35,8.0500,0,0
5,0,1,"McCarthy, Mr. Timothy J",male,54,51.8625,0,0
6,0,3,"Palsson, Master. Gosta Leonard",male,2,21.0750,3,1

In [8]:
import pandas as pede

df = pede.read_csv('titanic.csv')

print()
print('--- Ini adalah hasil dari Imputasi data dan menampilkan tujuh urutan akhir pada data. ---\n')

mean_age = df['age'].mean()
df['age'] = df['age'].fillna(mean_age)

df['age'] = df['age'].astype(int)
df.head(7)

--- Ini adalah hasil dari Imputasi data dan menampilkan tujuh urutan akhir pada data. ---

,survived,pclass,name,sex,age,fare,sibsp,parch
0,0,3,"Braund, Mr. Owen Harris",male,22,7.2500,1,0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,71.2833,1,0
2,1,3,"Heikkinen, Miss. Laina",female,26,7.9250,0,0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,53.1000,1,0
4,0,3,"Allen, Mr. William Henry",male,35,8.0500,0,0
5,0,1,"McCarthy, Mr. Timothy J",male,54,51.8625,0,0
6,0,3,"Palsson, Master. Gosta Leonard",male,2,21.0750,3,1